package hnau.lexplore.sentence.lang.noun

private val _nouns: List<Noun> = listOf(
    Noun("φαγητό", "еда"),
    Noun("ψωμί", "хлеб"),
    Noun("τυρί", "сыр"),
    Noun("γάλα", "молоко"),
    Noun("κρέας", "мясо"),
    Noun("κοτόπουλο", "курятина"),
    Noun("αυγό", "яйцо"),
    Noun("ρύζι", "рис"),
    Noun("σαλάτα", "салат"),
    Noun("φρούτο", "фрукт"),
    Noun("λαχανικό", "овощ"),
    Noun("πατάτα", "картофель"),
    Noun("κρεμμύδι", "лук"),
    Noun("καρότο", "морковь"),
    Noun("ντομάτα", "помидор"),
    Noun("αγγούρι", "огурец"),
    Noun("πιπεριά", "перец"),
    Noun("μήλο", "яблоко"),
    Noun("πορτοκάλι", "апельсин"),
    Noun("σταφύλι", "виноград"),
    Noun("καρπούζι", "арбуз"),
    Noun("σοκολάτα", "шоколад"),
    Noun("γλυκό", "десерт"),
    Noun("παγωτό", "мороженое"),
    Noun("τσάι", "чай"),
    Noun("ποτό", "напиток"),
    Noun("πάγος", "лед"),
    Noun("ζάχαρη", "сахар"),
    Noun("αλάτι", "соль"),
    Noun("αλεύρι", "мука"),
)

val Noun.Companion.list: List<Noun>
    get() = _nouns